{"data":{"site":{"siteMetadata":{"title":"Kitchen/Funk","author":"Faestos & Jan"}},"markdownRemark":{"id":"be74bdc0-0c4f-512d-baee-d7b98d3ee81f","excerpt":"I was about to watch 'Once upon a Time in America' yesterday evening only to be demotivated by the sheer running time (almost 4hrs) and my own tiredness after a…","html":"<p><img height=\"715\" width=\"100%\" src=\"/camille-2000.jpg\" style=\"object-fit:cover\"></img></p>\n<p>I was about to watch 'Once upon a Time in America' yesterday evening only to be demotivated by the sheer running time (almost 4hrs) and my own tiredness after a full week of work. But it reminded me again of the magic of Italian cinema scores. For Sergio Leone the story and dialogues were only the necessary evil. The real magic is in the images which are still timeless  but also full of meaning laden symbols and  views into to the inner struggle of complex characters. With the orchestra scores of 'Ennio Morricone' a life of its own unfolds on the screen which has enough similarities with the real world to find a personal connection but it represents also something otherworldly, something that existed in another timeline in the mind of the cineaste.\n<a href=\"https://www.youtube.com/watch?v=VZ9P3J0QuVU\">https://www.youtube.com/watch?v=VZ9P3J0QuVU</a></p>\n<p>No discussion about that, the movies of Sergio Leone are masterpieces in cinematography but he was not the only one. I'm not an expert but there are other filmmakers from Italy who deservers to be mentioned such as 'Sergio Corbucci'. Sometimes, their movies were not that great because followed the b-movie genre due to financial restrictions but the soundtracks were often a goody bag of epic jazz funk grooves composed for an orchestra. I'm a big fan of 'Piero Umiliani', who composed the world famous 'manana' but also did the equally genius 'Continente Nero' which reminds me of  Johnny Hammond – Los Conquistadores Chocolates. famously played in the loft by David Mancuso. Another composer 'Piero Piccioni'  scored the film 'Camille 2000' which I'm super proud to be the owner of the soundtrack. I have not watched the movie yet but the cover art is without comparison a masterpiece of corniness. Nobody else than 'Quentin Tarantino' pays as much homage in his films. For more info check out the foreword of the book 'Once upon a time in the west' and all his movies</p>\n<iframe width=\"100%\" height=\"315\" src=\"https://www.youtube.com/embed/VZ9P3J0QuVU\" frameborder=\"0\" allow=\"accelerometer; autoplay; encrypted-media; gyroscope; picture-in-picture\" allowfullscreen></iframe>\n<p>Unfortunately, I just started my journey to collect film scores. That's why I don't have all the classics to play but I have some other art film soundtracks. We play a lot of 'Johanna Billing' who direct her films as social happenings where she actually does not direct the entire process of creation. For example in 'Muelheim jazz session', she creates artificially a traffic jam in the rural area of Pulheim. To pass time people 'spontaneously start to busy themselves; eating fruit, doing crosswords, play around with their dogs in the fields and talking'. (<a href=\"http://johannabilling.com/pulheim-jam-session-2015-hd-2240-loop/\">http://johannabilling.com/pulheim-jam-session-2015-hd-2240-loop/</a>).</p>\n<iframe width=\"100%\" height=\"300\" scrolling=\"no\" frameborder=\"no\" allow=\"autoplay\" src=\"https://w.soundcloud.com/player/?url=https%3A//api.soundcloud.com/tracks/612258681&color=%23ff5500&auto_play=false&hide_related=false&show_comments=true&show_user=true&show_reposts=false&show_teaser=true&visual=true\"></iframe>","frontmatter":{"title":"Pulp Fiction","date":"May 16, 2019","description":"I was about to watch 'Once upon a Time in America' yesterday evening only to be demotivated by the sheer running time and my own tiredness."}}},"pageContext":{"slug":"/pulp-fiction/","previous":{"fields":{"slug":"/hyperactive-ambient/"},"frontmatter":{"title":"Hyperactive Ambient"}},"next":null}}