{"data":{"site":{"siteMetadata":{"title":"Kitchen/Funk","author":"Faestos & Jan"}},"markdownRemark":{"id":"9cbe88ae-ddfb-5540-8447-91bbc3908ac3","excerpt":"I'm Jan 30 years old, born in 88 my colleague is 29 born one year later. We like music, sometimes too much. We listen to it while fighting with our Phd topics…","html":"<p>I'm Jan 30 years old, born in 88 my colleague is 29 born one year later. We like music, sometimes too much. We listen to it while fighting with our Phd topics. Our days are spent  by digging through the vast world of music on the internet trying to find the one hidden gem. On other days we even eat from it and prepare a radio show. This is what you can witness right now.</p>\n<blockquote>\n<p>This is the first post to commemorate our radio show which happens monthly on Xlair radio. Don't expect anything\nprofessional. We are bloody amateurs without a real agenda except for the deep conviction to spread our fascination for\nmusic which comes straight from the heart!</p>\n</blockquote>\n<p>Our first topic from our analogue music cuisine is Disco which is really something special for me because it helped through a lot of difficult moments in my youth when growing up in some rural area in Germany. In the beginning, Disco was not more than a word floating around in the media like an old car nobody wants to drive anymore.  It had the same smell as the seats which were old, dusty, moist and too soft. The echos of that music you could still find in some antiquated television shows  which used it as backing track for some poorly executed action scenes. In record stores Disco music was always put in the lower shelves which were hard to reach and sold for nothing more than a few euros.</p>\n<iframe src=\"https://giphy.com/embed/1PkxzVZ626NdC\" width=\"680\" height=\"270\" frameBorder=\"0\" class=\"giphy-embed\" allowFullScreen></iframe>\n<p>Abba was Disco as much as the Begees or John Travolta. Your parents were Disco and Rock 'n' Roll was it definitely not.  So, in short Disco sucked. But now this genre  is celebrating a comeback and paradoxically enough. I feel a bit old to explain you why. When going into clubs , I often feel touched to hear all these tracks I listened alone in my room getting finally aired in public. I can't even fully enjoy it because it seems so surreal. Young people around me crying to Donna Summer or Silvester I really ask myself  how do they got into that? The idea of the dancefloor as a space to  be free is was the big dream for a generation of young dancers. It did not matter if you are rich or poor, black or white, gay or straight. In the repetition the beat people experienced freedom perhaps for the first time in their life. But the Disco movement has failed just as the hippies or punks did . Its early idealism was soon to be caught by reality. Big Money, drug addiction sex work and AIDS found their way to the dancefloor. Young people today don't realize this, they were never part of the scene. The only thing they remember are the songs, these long extended percussive workouts full of funk, soul and the cry for freedom. On Youtube, some Disco tracks have more than 1 million plays which is impressive because they are tools for Djs not meant to be played on a smartphone with these little ear plugs. Some people say that Disco is dead because it is decontextualized and reappropriated from its origin which was marginal, black and gay, thereby losing its soul and serving the big money machine of capitalism. Other say that Disco is still alive and kicking after all these years and creates a narrative for artists, club goers and listeners who are in need of faith.</p>\n<p>As life is, the matter is complicated. But when I'm alone in my room watching the stars Disco kicks my ass and frees my mind. It makes me move forward and shows me what's possible in life.</p>\n<p><img src=\"./salty_egg.jpg\" alt=\"Chinese Salty Egg\"></p>","frontmatter":{"title":"Disco for Old People","date":"February 24, 2019","description":null}}},"pageContext":{"slug":"/disco-for-old-ppl/","previous":{"fields":{"slug":"/hi-folks/"},"frontmatter":{"title":"New Beginnings"}},"next":null}}