{"data":{"site":{"siteMetadata":{"title":"Kitchen/Funk","author":"Faestos & Jan"}},"markdownRemark":{"id":"33ab877d-847f-5c72-bf10-4a20a7019bf6","excerpt":"\n img courtesy of Fcois Close your eyes and listen to the sounds around you. What do you hear? Maybe you are on the street\nand hear the traffic. Perhaps you are…","html":"<p><img height=\"515\" width=\"100%\" src=\"/photo_00.jpg\" style=\"object-fit:cover;margin:0\"></img>\n<span style=\"color:grey;font-style:italic\">img courtesy of Fcois</span></p>\n<p>Close your eyes and listen to the sounds around you. What do you hear? Maybe you are on the street\nand hear the traffic. Perhaps you are in the forest and you hear birds chirping. It could be that you hear\nthe hum of your fridge. The sounds we hear around us - the ‘background noise’ - are part of the\nambience of a location. A simple definition of ambient music would therefore be ‘background music’.\nAnd while this is partially true, ambient is so much more.\nAmbient music comes in many shapes and sizes, that all have one thing in common: they invoke a\ncertain state of mind. Ambient can make you happy or sad. It can make you feel relaxed or agitated. It\nmight make you relive a memory or have a vision of the future. This state of mind (or emotion/feeling, if\nyou will) is achieved in a different way than most other types of music. Ambient usually does not rely on\nlyrics or melodic riffs, but instead uses slowly evolving soundscapes and diffuse harmonics to achieve\nthe desired effect.</p>\n<iframe width=\"100%\" height=\"315\" src=\"https://www.youtube.com/embed/vNwYtllyt3Q\" frameborder=\"0\" allow=\"accelerometer; autoplay; encrypted-media; gyroscope; picture-in-picture\" allowfullscreen></iframe>\n<p>As with most genres of music, there are many different types of ambient music with their own specific\ncharacteristics. The focus often lies on the texture of the sound, which can be made using synthesizers,\nacoustic instruments or sampling nature or urban sounds. Delay and reverb effects are often generously\nused (watch out though: less is more) to give an atmospheric quality to the sound. Cascading pads or\nchanting vocals are also common. Ambient usually doesn’t have strong rhythmic components such as\ndrums or sharp percussion, but many exceptions exist. Crossovers with techno, house and jungle are\nnumerous, with notable early contributions being Aphex Twin’s Selected Ambient Works 85-92 and\nBiosphere’s Microgravity.</p>\n<iframe width=\"100%\" height=\"315\" src=\"https://www.youtube.com/embed/8ET1vST_xKc\" frameborder=\"0\" allow=\"accelerometer; autoplay; encrypted-media; gyroscope; picture-in-picture\" allowfullscreen></iframe>\n<iframe width=\"100%\" height=\"300\" scrolling=\"no\" frameborder=\"no\" allow=\"autoplay\" src=\"https://w.soundcloud.com/player/?url=https%3A//api.soundcloud.com/tracks/612258681&color=%23ff5500&auto_play=false&hide_related=false&show_comments=true&show_user=true&show_reposts=false&show_teaser=true&visual=true\"></iframe>","frontmatter":{"title":"Hyperactive Ambient","date":"April 24, 2019","description":"Close your eyes and listen to the sounds around you. What do you hear? Maybe you are on the street..."}}},"pageContext":{"slug":"/ambient/","previous":{"fields":{"slug":"/acid-struggle/"},"frontmatter":{"title":"Acid Struggle"}},"next":{"fields":{"slug":"/hyperactive-ambient/"},"frontmatter":{"title":"Hyperactive Ambient"}}}}