{"data":{"site":{"siteMetadata":{"title":"Kitchen/Funk","author":"Faestos & Jan"}},"markdownRemark":{"id":"065e45de-5cf1-57c1-affd-cbe4583516cc","excerpt":"You might have noticed that we struggled a lot to define Acid House\nin our new show. And you are right, it's really hard to make sense of all these sub-genres…","html":"<p>You might have noticed that we struggled a lot to define Acid House\nin our new show. And you are right, it's really hard to make sense of all these sub-genres. There are too many of them. Every few years a new wave of artists comes along sound tagged with a new genre label.</p>\n<p>Are Skrillex, Diplo or David Guetta House? Nowadays, it is called EDM but the basic formula is the same for almost 40 years.</p>\n<p>In the beginning, there was only one style. It started all in Chicago, some guys in a basement misused some drum-machines and synthesizers developed to accompany studio musicians, replayed some disco hits and boom we got House music.\nSoon after, they found a even more peculiar machine called TB-303 which could be tweaked to make sounds as distorted and sharp that I always imagined some burning pigeons stuck in a toaster making their last noises. The result was Acid House. My personal favorite was always Adonis with 'No Way Back' which sounds like late night drive through an industrial zone, with the devil on your mind you just sold your soul to.</p>\n<p>To be accurate the TB-303 was already played on some other records before but its sound did not gain mainstream momentum. Already in 1979 an Indian film musician used the TB-303 extensively to fulfill his vision traditional Ragas on a disco beat.</p>\n<p>Nonetheless, according to Wikipedia, the credits to go to Phuture and DJ Pierre as the inventors of the Acid sound. But as always, when a new music genre is born it's hard to point down to one specific person or group as originators. It was a collective effort which did not stop with just producing and publish records. It was a whole DIY way of dealing with music and life in general.</p>\n<p>Later in the 80ies things got a bit complicated because House travelled to Detroit where some young DJs, notably the Belleville three shaped Techno under the influence of some early European electronic artists.\nIn New York producers and DJs referred back to the colorful disco past of the city in form of Garage House was discovered. I don't wanna recall the whole history of House (we can't be accurate) but DJs like Tony Humphries or labels such as Nu-Groove, Strictly-Rhythm hosted some of the finest House records in the late 80ies full of soulful vocals and smooth chords but also some solid Acid bombs. Bobby Konders for instance added Dub rasta vocals to the House formula.</p>\n<p>In the meantime American dance music was exported back to Europe influencing a whole generation of young musicians. Especially, in UK lot of local bands adopted the synthesiszers and drum machines into their setup creating a sound which does not follow any genre conventions.</p>\n<p>Bands such as Happy Mondays, Stone-Roses or New-Order had one foot in foot in the concert hall and another one in a sweaty club full of ravers high on ecxtacy. But it was not until the summer of love in 1988 until Acid House parties were called Raves. Every weekend thousand of ravers went into clubs or  outdoor festivals celebrating hedonism as a response to their fad life perspectives in a country which was struck by the hopelessness of late</p>\n<iframe src=\"https://giphy.com/embed/1PkxzVZ626NdC\" width=\"100%\" height=\"370\" frameBorder=\"0\" class=\"giphy-embed\" allowFullScreen></iframe>","frontmatter":{"title":"Disco for Old People","date":"April 14, 2019","description":"I'm Jan 30 years old, born in '88 and my colleague Stephan is 29 born one year later. We like music..."}}},"pageContext":{"slug":"/acid-struggle/","previous":{"fields":{"slug":"/disco-for-old-ppl/"},"frontmatter":{"title":"Disco for Old People"}},"next":null}}