{"data":{"site":{"siteMetadata":{"title":"Kitchen/Funk","author":"Faestos & Jan"}},"markdownRemark":{"id":"065e45de-5cf1-57c1-affd-cbe4583516cc","excerpt":"\nWhat does it take to define Acid House? You might have noticed that we struggled a lot to answer that question in our new show. And you are right, it's really…","html":"<p><img height=\"515\" width=\"100%\" src=\"/acid-budda.png\" style=\"object-fit:contain\"></img>\nWhat does it take to define Acid House? You might have noticed that we struggled a lot to answer that question in our new show. And you are right, it's really hard to keep up with all these sub-genres. There are too many of them. Every few years a new wave of artists comes along tagged with a new genre label.</p>\n<blockquote>\n<p>Are <a href=\"https://en.wikipedia.org/wiki/Skrillex\">Skrillex</a>, <a href=\"https://en.wikipedia.org/wiki/Diplo\">Diplo</a> or <a href=\"https://en.wikipedia.org/wiki/David_Guetta\">David Guetta</a> House? Nowadays, it is called EDM but the basic formula is the same for almost 40 years.</p>\n</blockquote>\n<p>In the beginning, there was only one style. It started all in Chicago, some guys in a basement misused some drum-machines and synthesizers developed to accompany studio musicians, replayed some disco hits and boom we got House music.\nSoon after, they found an even more peculiar machine called <a href=\"https://en.wikipedia.org/wiki/Roland_TB-303\">Roland TB-303</a> which could be tweaked to make sounds as distorted and sharp that I always imagined some burning pigeons stuck in a toaster making their last noises. The result is Acid House. My personal favorite will be always always Adonis' with 'No Way Back' which sounds like a late night drive through an industrial zone with the devil on your mind you just sold your soul to.</p>\n<iframe width=\"100%\" height=\"315\" src=\"https://www.youtube.com/embed/Xvj1q_L_3iw\" frameborder=\"0\" allow=\"accelerometer; autoplay; encrypted-media; gyroscope; picture-in-picture\" allowfullscreen></iframe>\n<p>To be accurate, the TB-303 was already played on some other records before but its sound did not gain mainstream momentum.\nAlready in 1979, the Indian film musician <a href=\"https://www.theguardian.com/music/2011/may/10/charanjit-singh-acid-house-ten-ragas\">Charanjit Singh</a> used the machine extensively to fulfill his vision traditional Ragas on a disco beat.  In 1983, the new wave band Orange Juice featured the instrument in their seminal pop hit <a href=\"https://www.youtube.com/watch?v=QoqoxCr4054\">'Rip it up'</a> whose cheerful summer vibe is as far from Acid House as it can get.</p>\n<iframe width=\"100%\" height=\"315\" src=\"https://www.youtube.com/embed/BN8M2irJVJA\" frameborder=\"0\" allow=\"accelerometer; autoplay; encrypted-media; gyroscope; picture-in-picture\" allowfullscreen></iframe>\n<p>Nonetheless, according to Wikipedia, the credits to go to <a href=\"https://www.discogs.com/artist/1705-Phuture\">Phuture</a> and DJ Pierre as the inventors of the Acid sound. But as always, when a new music genre is born it's hard to point down to one specific person or group as originators. It was a collective effort which did not stop with just producing and publishing records. It was a whole new way of dealing with music, arts and life in general resulting in specific fashion style.\nLater in the 80ies, things got a bit more complicated because House travelled to Detroit where some young producers, notably the <a href=\"https://en.wikipedia.org/wiki/The_Belleville_Three\">Belleville Three</a> shaped the Techno sound under the influence of some early European electronic artists (Kraftwerk).\nIn New York producers and DJs remembered the colorful Disco past of the city and formed  Garage House. I don't wanna recall the whole history of House (we can't be accurate) but DJs like <a href=\"https://www.skiddle.com/news/all/Tony-Humphries-Interview-New-Jersey-Connection/32128/\">Tony Humphries</a> or labels such as <a href=\"https://www.discogs.com/label/608-Nu-Groove-Records\">Nu-Groove</a>, <a href=\"https://www.discogs.com/label/609-Strictly-Rhythm\">Strictly-Rhythm</a> hosted some of the finest House records in the decade full of soulful vocals and smooth chords but also some solid Acid bombs such as Bobby Konders' <a href=\"https://www.youtube.com/watch?v=ZkwoJvL_-Yc\">Nervous Acid</a> which added some Dub and Dancehall vibes to the House formula.</p>\n<p>In the meantime American dance music was exported back to Europe influencing a whole generation of young musicians. Especially, in the UK a lot of local bands adopted the synthesizer and drum machines into their setup creating a sound which does not follow any genre conventions. Bands such as Happy Mondays, Stone-Roses or New-Order had one foot in foot in the concert hall and another one in a sweaty club full of ravers high on ecstasy. But it was not until the <a href=\"https://en.wikipedia.org/wiki/Second_Summer_of_Love\">Summer Of Love</a> in 1988 until Acid House parties were called Raves. Every weekend thousand of ravers went into clubs or outdoor festivals celebrating hedonism as a response to their fad life perspectives in a country which was struck by the neo-liberal bullshit policies we all love so much. For less political mumbo jumbo check out our podcast below. In spirit of acid it's all DIY with funny mistakes:</p>\n<iframe width=\"100%\" height=\"300\" scrolling=\"no\" frameborder=\"no\" allow=\"autoplay\" src=\"https://w.soundcloud.com/player/?url=https%3A//api.soundcloud.com/tracks/594667014&color=%23ff5500&auto_play=false&hide_related=false&show_comments=true&show_user=true&show_reposts=false&show_teaser=true&visual=true\"></iframe>","frontmatter":{"title":"Acid Struggle","date":"April 14, 2019","description":"What does it take to define Acid House? Two bedroom DJs with not enough records but a lot of passion :-)."}}},"pageContext":{"slug":"/acid-struggle/","previous":{"fields":{"slug":"/disco-for-old-ppl/"},"frontmatter":{"title":"Disco for Old People"}},"next":null}}